config/gptel/tools/scope-shell-tools.org
**** Compound Operators Without Spaces
#+begin_example
Input: "ls&&cd"
Expected: "ls"
Rationale: Regex "[ |><;&]+" splits on & without requiring spaces
#+end_example

**** Quoted Arguments
#+begin_example
Input: "echo 'hello world'"
Expected: "echo"
Rationale: Quotes appear in arguments, not command name
#+end_example

**** Command Substitution
#+begin_example
Input: "echo $(date)"
Expected: "echo"
Rationale: Substitution happens in argument position
#+end_example

**** Complex Pipes
#+begin_example
Input: "grep -r pattern . | head -20 | tail -5"
Expected: "grep"
Rationale: Multi-stage pipeline - only first command matters
#+end_example

**** Background Execution
#+begin_example
Input: "sleep 10 &"
Expected: "sleep"
Rationale: & operator doesn't affect command extraction
#+end_example

**** Quoted Strings with Metacharacters (Known Limitation)
#+begin_example
Input: "echo 'a|b'"
Expected: "echo" (CORRECT for security purposes)
Note: Parsing doesn't distinguish metacharacters inside quotes from outside.
      This is acceptable - we only need base command for categorization.

Input: "grep 'pattern|other' file"
Expected: "grep" (CORRECT)
Rationale: Even if argument parsing is naive, base command extraction is reliable.
#+end_example

This implementation uses simple regex splitting rather than full shell parsing. For security categorization, only the base command matters - argument content is irrelevant to whether the command is read-only, safe-write, or dangerous.

*** Security Implications

*Why only validate base command:*

1. *Primary security boundary*: If =grep= is categorized as =read_only=, composing it with =head= or =tail= doesn't increase risk
2. *Parsing complexity*: Full pipeline parsing is error-prone and fragile
3. *Marginal benefit*: Validating every command in a pipeline provides minimal additional security
4. *LLM behavior*: The LLM learns safe patterns; overly restrictive parsing would force workarounds

*Known limitations:*

1. Command chaining (=;=, =&&=, =||=) only validates first command
2. Subsequent commands in chain bypass validation
3. This is acceptable because directory scope still applies to all operations
4. Dangerous commands in chain will fail on execution due to directory permissions


** Check Absolute Paths

Check if command contains absolute paths that bypass directory scoping.

#+begin_src elisp
(defun jf/gptel-bash--check-absolute-paths (command)
  "Check if COMMAND contains absolute paths.
Returns warning string if found, nil otherwise."
  (when (string-match "/[[:alnum:]_/-]+" command)
    "Warning: Command contains absolute path arguments. Directory scope may not protect these paths."))
#+end_src

** Execute Command

Execute command in directory with timeout and output truncation.

#+begin_src elisp
(defun jf/gptel-bash--execute-command (command directory)
  "Execute COMMAND in DIRECTORY with timeout and output truncation.
Returns (:output OUTPUT :exit_code CODE :truncated BOOL :warnings LIST :error ERROR-TYPE).
Warnings are returned in a separate field to allow LLM to distinguish them from command output.
Error types: timeout, execution-failed."
  (let* ((default-directory (file-truename (expand-file-name directory)))
         (output nil)
         (exit-code nil)
         (truncated nil)
         (warnings nil)
         (error-type nil)
         (max-output-chars 10000))

    (condition-case err
        (with-timeout (30  ; 30-second timeout
                       (progn
                         (setq error-type "timeout")
                         (setq exit-code 124)  ; GNU timeout exit code
                         (setq output "Command execution timed out after 30 seconds. Output may be incomplete.")
                         (setq warnings (list "Command timed out - use more specific filters to reduce execution time"))))
          (setq output
                (with-temp-buffer
                  (setq exit-code
                        (call-process shell-file-name nil t nil
                                      shell-command-switch command))
                  (buffer-string))))
      (error
       (cl-return-from jf/gptel-bash--execute-command
         (list :output (format "Command execution failed: %s" (error-message-string err))
               :exit_code 1
               :error "execution-failed"
               :truncated nil
               :warnings nil))))

    ;; Truncate output if too long
    (let ((original-length (length output)))
      (when (> original-length max-output-chars)
        (setq truncated t)
        (setq output
              (concat (substring output 0 max-output-chars)
                      (format "\n\n[Output truncated at %d chars. Total: %d chars. Use filters like 'head', 'grep', or 'tail' to narrow results.]"
                              max-output-chars original-length)))))

    ;; Check for warnings (collect in list, don't modify output)
    (let ((path-warning (jf/gptel-bash--check-absolute-paths command)))
      (when path-warning
        (setq warnings (list path-warning))))

    (list :output output
          :exit_code exit-code
          :truncated truncated
          :warnings warnings
          :error error-type)))
#+end_src

* Run Bash Command Tool (Scope-Aware, v3.0)

Execute bash commands in specified directory with category-based scope validation.

** Tool Signature

Function: =run_bash_command(command, directory)=

*Parameters:*
- =command= (string, required): Shell command to execute, including any arguments, pipes, or redirects
- =directory= (string, required): Absolute path to working directory where command executes. This is the working directory (cwd) for the shell process - all relative paths in the command are resolved from this directory. The directory must exist and must be in scope for the command's category (read_only requires paths.read or paths.write, safe_write requires paths.write)

*Returns:*
- =success= (boolean): Whether command executed successfully
- =stdout= (string): Command output (truncated if too long)
- =stderr= (string): Command error output
- =exit_code= (integer): Process exit code
- =error= (string): Error type if validation failed

** Common Usage Patterns

*Codebase exploration (read_only):*
#+begin_example
run_bash_command("ls -la", "/Users/jefffarr/projects/myapp")
run_bash_command("find . -name '*.py' -type f", "/Users/jefffarr/projects/myapp")
run_bash_command("grep -rn 'TODO' src/", "/Users/jefffarr/projects/myapp")
run_bash_command("git log --oneline -10", "/Users/jefffarr/projects/myapp")
#+end_example

*File creation (safe_write):*
#+begin_example
run_bash_command("mkdir -p scratch/experiment", "/Users/jefffarr/emacs")
run_bash_command("touch notes.txt", "/tmp")
run_bash_command("echo 'content' > file.txt", "/tmp")
#+end_example

*Git operations:*
#+begin_example
run_bash_command("git status", "/Users/jefffarr/emacs")          # read_only
run_bash_command("git add config/file.el", "/Users/jefffarr/emacs")  # safe_write
run_bash_command("git commit -m 'message'", "/Users/jefffarr/emacs") # safe_write
#+end_example

*Shell composition:*
#+begin_example
run_bash_command("grep pattern . | head -20", "/Users/jefffarr/projects/myapp")
run_bash_command("find . -name '*.org' | wc -l", "/Users/jefffarr/emacs")
run_bash_command("ls -la > listing.txt", "/tmp")
#+end_example

** Troubleshooting

*** Command denied unexpectedly

*Symptom:* Command should be allowed but gets "command_not_allowed" error

*Check:*
1. Is base command in any category list? (not full command with arguments)
2. Spelling matches exactly? (case-sensitive)
3. Git commands use full form? (=git log= not just =git=)

*** Directory scope error

*Symptom:* "directory_not_in_scope" error

*Check:*
1. Does directory match paths.read or paths.write pattern?
2. Is directory in paths.deny?
3. For safe_write commands, is directory in paths.write (not just paths.read)?
4. Are glob patterns correct? (=**= for recursive, =*= for single level)

*** Timeout errors

*Symptom:* Command killed after 30 seconds

*Solution:*
- Use more specific filters: =grep -r pattern . --include='*.el'=
- Limit scope: =find . -maxdepth 3 -name '*.org'=
- Use =head= to limit output: =git log | head -50=

*** Truncated output

*Symptom:* Output ends with truncation notice

*Solution:*
- Add filters: =grep=, =head=, =tail= to narrow results
- Use more specific patterns: =find . -name 'exact-name.txt'=
- Process in chunks: Multiple commands with different filters

** Tool Implementation

#+begin_src elisp
(gptel-make-scoped-tool
 "run_bash_command"
 "Execute shell command in specified directory with scope validation.

Commands are categorized:
- read_only: ls, grep, find, cat, head, tail, wc, file, git log, git show, git diff
- safe_write: mkdir, touch, echo, git add, git commit
- dangerous: (empty by default, requires explicit approval)

Directory must be in scope for command category:
- read_only commands: directory must match paths.read OR paths.write
- safe_write commands: directory must match paths.write

Shell composition allowed (pipes, redirects, command substitution), but only base command is validated.

Security features:
- 30-second timeout
- Output truncation at 10,000 chars
- Warnings for absolute paths in arguments
- Deny list blocks dangerous commands (rm, rmdir, mv, cp, ln, scp, rsync, chmod, sudo, crontab, iptables, systemctl, useradd, shutdown, reboot, halt, poweroff, etc.)

Examples:
  run_bash_command('ls -la', '/Users/jefffarr/emacs')
  run_bash_command('grep -r TODO . | head -20', '/Users/jefffarr/projects/myapp')
  run_bash_command('git log --oneline -10', '/Users/jefffarr/emacs')
  run_bash_command('mkdir scratch', '/tmp')"

 (list '(:name "command"
         :type string
         :description "Shell command to execute (pipes and redirects allowed)")
       '(:name "directory"
         :type string
         :description "Working directory (must be in scope for command category)"))

 "bash"

 ;; Tool body - executed only if validation passes
 (let* ((result (jf/gptel-bash--execute-command command directory))
        (exit-code (plist-get result :exit_code))
        (output (plist-get result :output))
        (truncated (plist-get result :truncated))
        (warnings (plist-get result :warnings))
        (success (zerop exit-code)))
   (list :success success
         :output output
         :exit_code exit-code
         :truncated truncated
         :warnings warnings)))
#+end_src

